requests/iti-44-gassmann-eprik.http

### PIXv3 Feed ITI-44
POST https://test.ahdis.ch/eprik-cara/camel/cara/eprik/UPIProxy/services/PIXPDQV3ManagerService HTTP/1.1
Content-Type: application/soap+xml;charset=UTF-8

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201301UV02</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:580a2592-95e6-4eec-ac08-5b7a829121cd</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://test.ahdis.ch/eprik-cara/camel/cara/eprik/UPIProxy/services/PIXPDQV3ManagerService</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><PRPA_IN201301UV02 xmlns="urn:hl7-org:v3" ITSVersion="XML_1.0">
    <id extension="1663085780134" root="1.3.6.1.4.1.21367.2017.2.1.104"/>
    <creationTime value="20220922045303"/>
    <interactionId extension="PRPA_IN201301UV02" root="2.16.840.1.113883.1.6"/>
    <processingCode code="T"/>
    <processingModeCode code="T"/>
    <acceptAckCode code="AL"/>
    <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="2.16.756.5.30.1.191.1.0.12.1.101.2"/>
        </device>
    </receiver>
    <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="2.16.756.5.30.1.145.1.1"/>
        </device>
    </sender>
    <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_TE201301UV02" codeSystem="2.16.840.1.113883.1.6"/>
        <subject contextConductionInd="false" typeCode="SUBJ">
            <registrationEvent classCode="REG" moodCode="EVN">
                <statusCode code="active"/>
                <subject1 typeCode="SBJ">
                    <patient classCode="PAT">
                        <!-- Only the new, local ID to be added, and the EPR-SPID SHALL be specified here -->
                        <id extension="P003" root="2.16.756.5.30.1.145.1.3"/>
                        <id extension="761337613645876216" root="2.16.756.5.30.1.127.3.10.3"/>
                        <statusCode code="active"/>
                        <patientPerson classCode="PSN" determinerCode="INSTANCE">
                            <name>
                                <family>GASSMANN-IMHOLZ</family>
                                <given>CYRIL RENE FRANCOIS</given>
                            </name>
                            <telecom value="+41774997788"/>
                            <telecom use="HP" value="mailto:test.plateforme@cara.ch"/>
                            <administrativeGenderCode code="M" codeSystem="2.16.840.1.113883.12.1" displayName="Male"/>
                            <birthTime value="19970209"/>
                        </patientPerson>
                        <providerOrganization classCode="ORG" determinerCode="INSTANCE">
                            <!-- The same systems as used in patient/id SHALL be specified here -->
                            <id root="2.16.756.5.30.1.145.1.3"/>
                            <id root="2.16.756.5.30.1.127.3.10.3"/>
                            <name>EPRIK primary system</name>
                            <contactParty classCode="CON">
                                <telecom value="mailto:info@ahdis.ch"/>
                            </contactParty>
                        </providerOrganization>
                    </patient>
                </subject1>
                <custodian typeCode="CST">
                    <assignedEntity classCode="ASSIGNED">
                        <id root="2.16.756.5.30.1.145.1.3"/>
                        <assignedOrganization classCode="ORG" determinerCode="INSTANCE">
                            <name>EPRIK Administration</name>
                        </assignedOrganization>
                    </assignedEntity>
            </custodian>
            </registrationEvent>
        </subject>
    </controlActProcess>
</PRPA_IN201301UV02></soap:Body></soap:Envelope>
